<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <!--
      This Amos Professional Manual is written by asymetrix for the Amiga community and should stay completly FREE FOREVER.
      Created 2008. :)
  -->
  <title>Amos Professional Manual - AMOS Interface</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <meta name="keywords" content="Amos Professional, Amiga, Programming, Basic, Francois Lionet, Europress Software Ltd, Amos, computing, code, AmigaDOS">
  <meta name="author" content="asymetrix">

</head>

<body bgcolor="white">

<a href="../index.html">Amos Professional Manual</a>&nbsp; <a href="../contents/c1.html">Contents</a>&nbsp; <a href="../14/1446.html">Index</a>

<h1>AMOS Interface</h1>

<br>

<p>
The use of quotation' marks in Interface programs is very important. You are recommended to
use single quotation marks as above, instead of the conventional double quotes. This will avoid
any confusion when Interface commands are typed into an ordinary AMOS Professional string.</p>

<p>Numbers may also be entered in Hexadecimal or Binary notation, if preferred. For example:</p>

<pre>
X> SetVar 2,$2A;
   SetVar 3,%101010;
</pre>

<p><b>PR</b>int<br>
<i>Interface instruction: print contents of a variable to screen</i><br>
<b>PR</b> x,y,number,ink;<br>
<b>PR</b> x,y,'text',ink;</p>

<p>
The PRint command is used to print the contents of a variable. After the command, the target
coordinates should be specified, followed by the variable number or the string of characters to
be printed. The final parameter is a colour index number, which determines the ink colour to be
used. The following example prints a message at coordinates 10,10 using colour 2. Note the use
of single quotation marks, which is explained above.</p>

<pre>
X> PRint 10,10,'Message',2;
</pre>

<p>The next example would print the contents of 1 VA at the coordinates 0,100 in ink colour 2:</p>

<pre>
X> PRint 0,100,1 VA,2;
</pre>

<p>
The hash character # can be used as a special function, which converts a number into a string. It
is similar to the normal AMOS Professional STR$ function. When using this, the following
syntax must be observed:</p>

<pre>
X> PRint 0,110,1 VA #,2;
</pre>

<p><b>Expressions</b><br>

AMOS Professional Interface expressions have been carefully optimised for speed, which is why
they appear very different from the standard system.</p>

<p>
All calculations are performed in reverse, with operations and functions after the numbers. So a
normal expression like 1+2 is entered as 12+ for an Interface program. Similarly:</p>

<pre>
6*9 becomes 69*
8/2 is 82/
6-3 is generated by 63-
</pre>

<p>
These expressions can be entered as part of a normal Interface command. Supposing you want
to add one to the variable zero (0 VA). This could be achieved by using a line such as:</p>

<pre>
X> SetVar 0,0 VA 1+;
</pre>

<div align="right"> <a href="903.html">Back</a> &nbsp;&nbsp;
  <a href="905.html">Next</a>
  <br>
  09.01.04
</div>

</BODY>
</HTML>
